stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_ll_sdmmc.c
  else if (__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CCRCFAIL))
  {
    /* Card is not SD V2.0 compliant */
    __SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_FLAG_CCRCFAIL);

    return SDMMC_ERROR_CMD_CRC_FAIL;
  }
  else
  {
    /* Nothing to do */
  }

  if (__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CMDREND))
  {
    /* Card is SD V2.0 compliant */
    __SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_FLAG_CMDREND);
  }

  return SDMMC_ERROR_NONE;

}

/**
  * @}
  */


/** @defgroup HAL_SDMMC_LL_Group6 Linked List functions
  *  @brief   Linked List management functions
  *
@verbatim
 ===============================================================================
                   ##### Linked List management functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to manage the needed functions.

@endverbatim
  * @{
  */

/**
  * @brief  Build new Linked List node.
  * @param  pNode: Pointer to new node to add.
  * @param  pNodeConf: Pointer to configuration parameters for new node to add.
  * @retval Error status
  */
uint32_t SDMMC_DMALinkedList_BuildNode(SDMMC_DMALinkNodeTypeDef *pNode, const SDMMC_DMALinkNodeConfTypeDef *pNodeConf)
{

  if ((pNode == NULL) || (pNodeConf == NULL))
  {
    return SDMMC_ERROR_INVALID_PARAMETER;
  }
  /* Configure the Link Node registers*/
  pNode->IDMABASER = pNodeConf->BufferAddress;
  pNode->IDMABSIZE = pNodeConf->BufferSize;
  pNode->IDMALAR   = SDMMC_IDMALAR_ULS | SDMMC_IDMALAR_ABR;

  return SDMMC_ERROR_NONE;
}

/**
  * @brief  Insert new Linked List node.
  * @param  pLinkedList: Pointer to the linkedlist that contains transfer nodes
  * @param  pPrevNode: Pointer to previous node .
  * @param  pNewNode: Pointer to new node to add.
  * @retval Error status
  */
uint32_t SDMMC_DMALinkedList_InsertNode(SDMMC_DMALinkedListTypeDef *pLinkedList, SDMMC_DMALinkNodeTypeDef *pPrevNode,
                                        SDMMC_DMALinkNodeTypeDef *pNode)
{
  uint32_t link_list_offset;
  uint32_t node_address = (uint32_t) pNode;

  /* First Node */
  if (pLinkedList->NodesCounter == 0U)
  {

    pLinkedList->pHeadNode = pNode;
    pLinkedList->pTailNode = pNode;
    pLinkedList->NodesCounter = 1U;

  }
  else if (pPrevNode == pLinkedList->pTailNode)
  {
    if (pNode <= pLinkedList->pHeadNode)
    {
      /* Node Address should greater than Head Node Address*/
      return SDMMC_ERROR_INVALID_PARAMETER;
    }

    /*Last Node, no next node */
    MODIFY_REG(pPrevNode->IDMALAR, SDMMC_IDMALAR_ULA, 0U);

    /*link Prev node with new one */
    MODIFY_REG(pPrevNode->IDMALAR, SDMMC_IDMALAR_ULA, SDMMC_IDMALAR_ULA);
    MODIFY_REG(pPrevNode->IDMALAR, SDMMC_IDMALAR_IDMALA, (node_address - (uint32_t)pLinkedList->pHeadNode));

    pLinkedList->NodesCounter ++;
    pLinkedList->pTailNode = pNode;

  }
  else
  {

    if (pNode <= pLinkedList->pHeadNode)
    {
      /* Node Address should greater than Head Node Address*/
      return SDMMC_ERROR_INVALID_PARAMETER;
    }

    /*link New node with Next one */
    link_list_offset = pNode->IDMALAR;
    MODIFY_REG(pPrevNode->IDMALAR, SDMMC_IDMALAR_IDMALA, link_list_offset);

    /*link Prev node with new one */
    MODIFY_REG(pPrevNode->IDMALAR, SDMMC_IDMALAR_ULA, SDMMC_IDMALAR_ULA);
    MODIFY_REG(pPrevNode->IDMALAR, SDMMC_IDMALAR_IDMALA, (node_address - (uint32_t)pLinkedList->pHeadNode));

    pLinkedList->NodesCounter ++;

  }
  return SDMMC_ERROR_NONE;
}

/**
  * @brief  Remove  node from the Linked List.
  * @param  pLinkedList: Pointer to the linkedlist that contains transfer nodes
  * @param  pNode: Pointer to new node to add.
  * @retval Error status
   */
uint32_t SDMMC_DMALinkedList_RemoveNode(SDMMC_DMALinkedListTypeDef *pLinkedList, SDMMC_DMALinkNodeTypeDef *pNode)
{
  uint32_t count = 0U;
  uint32_t linked_list_offset;
  SDMMC_DMALinkNodeTypeDef *prev_node = NULL;
  SDMMC_DMALinkNodeTypeDef *curr_node ;

  /* First Node */
  if (pLinkedList->NodesCounter == 0U)
  {

    return SDMMC_ERROR_INVALID_PARAMETER;
  }
  else
  {
    curr_node = pLinkedList->pHeadNode;
    while ((curr_node != pNode) && (count <= pLinkedList->NodesCounter))
    {
      prev_node = curr_node;
      curr_node = (SDMMC_DMALinkNodeTypeDef *)((prev_node->IDMALAR & SDMMC_IDMALAR_IDMALA) +
                                               (uint32_t)pLinkedList->pHeadNode);
      count++;
    }

    if ((count == 0U) || (count > pLinkedList->NodesCounter))
    {
      /* Node not found in the linked list */
      return SDMMC_ERROR_INVALID_PARAMETER;
    }

    pLinkedList->NodesCounter--;

    if (pLinkedList->NodesCounter == 0U)
    {
      pLinkedList->pHeadNode = 0U;
      pLinkedList->pTailNode = 0U;
    }
    else
    {
      /*link prev node with next one */
      linked_list_offset = curr_node->IDMALAR;
      MODIFY_REG(prev_node->IDMALAR, SDMMC_IDMALAR_IDMALA, linked_list_offset);
      /* Configure the new Link Node registers*/
      pNode->IDMALAR    |= linked_list_offset;

      pLinkedList->pTailNode = prev_node;
    }
  }
  return SDMMC_ERROR_NONE;
}

/**
  * @brief  Lock Linked List Node
  * @param  pNode: Pointer to node to lock.
  * @retval Error status

  */
uint32_t SDMMC_DMALinkedList_LockNode(SDMMC_DMALinkNodeTypeDef *pNode)
{

  if (pNode == NULL)
  {
    return SDMMC_ERROR_INVALID_PARAMETER;
  }

  MODIFY_REG(pNode->IDMALAR, SDMMC_IDMALAR_ABR, 0U);

  return SDMMC_ERROR_NONE;
}

/**
  * @brief  Unlock Linked List Node
  * @param  pNode: Pointer to node to unlock.
  * @retval Error status

  */
uint32_t SDMMC_DMALinkedList_UnlockNode(SDMMC_DMALinkNodeTypeDef *pNode)
{

  if (pNode == NULL)
  {
    return SDMMC_ERROR_INVALID_PARAMETER;
  }

  MODIFY_REG(pNode->IDMALAR, SDMMC_IDMALAR_ABR, SDMMC_IDMALAR_ABR);

  return SDMMC_ERROR_NONE;
}

/**
  * @brief  Enable Linked List circular mode
  * @param  pLinkedList: Pointer to the linkedlist that contains transfer nodes
  * @retval Error status

  */
uint32_t SDMMC_DMALinkedList_EnableCircularMode(SDMMC_DMALinkedListTypeDef *pLinkedList)
{

